IlleniumDillon/MM32F5277/PinMap/MM32_GPIO_PinMap.c
#include "MM32_GPIO_PinMap.h"

MM32_GPIO_Pin PA0 = {.port = GPIOA, .pin = P00};
MM32_GPIO_Pin PA1 = {.port = GPIOA, .pin = P01};
MM32_GPIO_Pin PA2 = {.port = GPIOA, .pin = P02};
MM32_GPIO_Pin PA3 = {.port = GPIOA, .pin = P03};
MM32_GPIO_Pin PA4 = {.port = GPIOA, .pin = P04};
MM32_GPIO_Pin PA5 = {.port = GPIOA, .pin = P05};
MM32_GPIO_Pin PA6 = {.port = GPIOA, .pin = P06};
MM32_GPIO_Pin PA7 = {.port = GPIOA, .pin = P07};
MM32_GPIO_Pin PA8 = {.port = GPIOA, .pin = P08};
MM32_GPIO_Pin PA9 = {.port = GPIOA, .pin = P09};
MM32_GPIO_Pin PA10 = {.port = GPIOA, .pin = P10};
MM32_GPIO_Pin PA11 = {.port = GPIOA, .pin = P11};
MM32_GPIO_Pin PA12 = {.port = GPIOA, .pin = P12};
MM32_GPIO_Pin PA13 = {.port = GPIOA, .pin = P13};
MM32_GPIO_Pin PA14 = {.port = GPIOA, .pin = P14};
MM32_GPIO_Pin PA15 = {.port = GPIOA, .pin = P15};

MM32_GPIO_Pin PB0 = {.port = GPIOB, .pin = P00};
MM32_GPIO_Pin PB1 = {.port = GPIOB, .pin = P01};
MM32_GPIO_Pin PB2 = {.port = GPIOB, .pin = P02};
MM32_GPIO_Pin PB3 = {.port = GPIOB, .pin = P03};
MM32_GPIO_Pin PB4 = {.port = GPIOB, .pin = P04};
MM32_GPIO_Pin PB5 = {.port = GPIOB, .pin = P05};
MM32_GPIO_Pin PB6 = {.port = GPIOB, .pin = P06};
MM32_GPIO_Pin PB7 = {.port = GPIOB, .pin = P07};
MM32_GPIO_Pin PB8 = {.port = GPIOB, .pin = P08};
MM32_GPIO_Pin PB9 = {.port = GPIOB, .pin = P09};
MM32_GPIO_Pin PB10 = {.port = GPIOB, .pin = P10};
MM32_GPIO_Pin PB11 = {.port = GPIOB, .pin = P11};
MM32_GPIO_Pin PB12 = {.port = GPIOB, .pin = P12};
MM32_GPIO_Pin PB13 = {.port = GPIOB, .pin = P13};
MM32_GPIO_Pin PB14 = {.port = GPIOB, .pin = P14};
MM32_GPIO_Pin PB15 = {.port = GPIOB, .pin = P15};

MM32_GPIO_Pin PC0 = {.port = GPIOC, .pin = P00};
MM32_GPIO_Pin PC1 = {.port = GPIOC, .pin = P01};
MM32_GPIO_Pin PC2 = {.port = GPIOC, .pin = P02};
MM32_GPIO_Pin PC3 = {.port = GPIOC, .pin = P03};
MM32_GPIO_Pin PC4 = {.port = GPIOC, .pin = P04};
MM32_GPIO_Pin PC5 = {.port = GPIOC, .pin = P05};
MM32_GPIO_Pin PC6 = {.port = GPIOC, .pin = P06};
MM32_GPIO_Pin PC7 = {.port = GPIOC, .pin = P07};
MM32_GPIO_Pin PC8 = {.port = GPIOC, .pin = P08};
MM32_GPIO_Pin PC9 = {.port = GPIOC, .pin = P09};
MM32_GPIO_Pin PC10 = {.port = GPIOC, .pin = P10};
MM32_GPIO_Pin PC11 = {.port = GPIOC, .pin = P11};
MM32_GPIO_Pin PC12 = {.port = GPIOC, .pin = P12};
MM32_GPIO_Pin PC13 = {.port = GPIOC, .pin = P13};
MM32_GPIO_Pin PC14 = {.port = GPIOC, .pin = P14};
MM32_GPIO_Pin PC15 = {.port = GPIOC, .pin = P15};

MM32_GPIO_Pin PD0 = {.port = GPIOD, .pin = P00};
MM32_GPIO_Pin PD1 = {.port = GPIOD, .pin = P01};
MM32_GPIO_Pin PD2 = {.port = GPIOD, .pin = P02};
MM32_GPIO_Pin PD3 = {.port = GPIOD, .pin = P03};
MM32_GPIO_Pin PD4 = {.port = GPIOD, .pin = P04};
MM32_GPIO_Pin PD5 = {.port = GPIOD, .pin = P05};
MM32_GPIO_Pin PD6 = {.port = GPIOD, .pin = P06};
MM32_GPIO_Pin PD7 = {.port = GPIOD, .pin = P07};
MM32_GPIO_Pin PD8 = {.port = GPIOD, .pin = P08};
MM32_GPIO_Pin PD9 = {.port = GPIOD, .pin = P09};
MM32_GPIO_Pin PD10 = {.port = GPIOD, .pin = P10};
MM32_GPIO_Pin PD11 = {.port = GPIOD, .pin = P11};
MM32_GPIO_Pin PD12 = {.port = GPIOD, .pin = P12};
MM32_GPIO_Pin PD13 = {.port = GPIOD, .pin = P13};
MM32_GPIO_Pin PD14 = {.port = GPIOD, .pin = P14};
MM32_GPIO_Pin PD15 = {.port = GPIOD, .pin = P15};

MM32_GPIO_Pin PE0 = {.port = GPIOE, .pin = P00};
MM32_GPIO_Pin PE1 = {.port = GPIOE, .pin = P01};
MM32_GPIO_Pin PE2 = {.port = GPIOE, .pin = P02};
MM32_GPIO_Pin PE3 = {.port = GPIOE, .pin = P03};
MM32_GPIO_Pin PE4 = {.port = GPIOE, .pin = P04};
MM32_GPIO_Pin PE5 = {.port = GPIOE, .pin = P05};
MM32_GPIO_Pin PE6 = {.port = GPIOE, .pin = P06};
MM32_GPIO_Pin PE7 = {.port = GPIOE, .pin = P07};
MM32_GPIO_Pin PE8 = {.port = GPIOE, .pin = P08};
MM32_GPIO_Pin PE9 = {.port = GPIOE, .pin = P09};
MM32_GPIO_Pin PE10 = {.port = GPIOE, .pin = P10};
MM32_GPIO_Pin PE11 = {.port = GPIOE, .pin = P11};
MM32_GPIO_Pin PE12 = {.port = GPIOE, .pin = P12};
MM32_GPIO_Pin PE13 = {.port = GPIOE, .pin = P13};
MM32_GPIO_Pin PE14 = {.port = GPIOE, .pin = P14};
MM32_GPIO_Pin PE15 = {.port = GPIOE, .pin = P15};

MM32_GPIO_Pin PF0 = {.port = GPIOF, .pin = P00};
MM32_GPIO_Pin PF1 = {.port = GPIOF, .pin = P01};
MM32_GPIO_Pin PF2 = {.port = GPIOF, .pin = P02};
MM32_GPIO_Pin PF3 = {.port = GPIOF, .pin = P03};
MM32_GPIO_Pin PF4 = {.port = GPIOF, .pin = P04};
MM32_GPIO_Pin PF5 = {.port = GPIOF, .pin = P05};
MM32_GPIO_Pin PF6 = {.port = GPIOF, .pin = P06};
MM32_GPIO_Pin PF7 = {.port = GPIOF, .pin = P07};
MM32_GPIO_Pin PF8 = {.port = GPIOF, .pin = P08};
MM32_GPIO_Pin PF9 = {.port = GPIOF, .pin = P09};
MM32_GPIO_Pin PF10 = {.port = GPIOF, .pin = P10};
MM32_GPIO_Pin PF11 = {.port = GPIOF, .pin = P11};
MM32_GPIO_Pin PF12 = {.port = GPIOF, .pin = P12};
MM32_GPIO_Pin PF13 = {.port = GPIOF, .pin = P13};
MM32_GPIO_Pin PF14 = {.port = GPIOF, .pin = P14};
MM32_GPIO_Pin PF15 = {.port = GPIOF, .pin = P15};

MM32_GPIO_Pin PG0 = {.port = GPIOG, .pin = P00};
MM32_GPIO_Pin PG1 = {.port = GPIOG, .pin = P01};
MM32_GPIO_Pin PG2 = {.port = GPIOG, .pin = P02};
MM32_GPIO_Pin PG3 = {.port = GPIOG, .pin = P03};
MM32_GPIO_Pin PG4 = {.port = GPIOG, .pin = P04};
MM32_GPIO_Pin PG5 = {.port = GPIOG, .pin = P05};
MM32_GPIO_Pin PG6 = {.port = GPIOG, .pin = P06};
MM32_GPIO_Pin PG7 = {.port = GPIOG, .pin = P07};
MM32_GPIO_Pin PG8 = {.port = GPIOG, .pin = P08};
MM32_GPIO_Pin PG9 = {.port = GPIOG, .pin = P09};
MM32_GPIO_Pin PG10 = {.port = GPIOG, .pin = P10};
MM32_GPIO_Pin PG11 = {.port = GPIOG, .pin = P11};
MM32_GPIO_Pin PG12 = {.port = GPIOG, .pin = P12};
MM32_GPIO_Pin PG13 = {.port = GPIOG, .pin = P13};
MM32_GPIO_Pin PG14 = {.port = GPIOG, .pin = P14};
MM32_GPIO_Pin PG15 = {.port = GPIOG, .pin = P15};

MM32_GPIO_Pin PH0 = {.port = GPIOH, .pin = P00};
MM32_GPIO_Pin PH1 = {.port = GPIOH, .pin = P01};
MM32_GPIO_Pin PH2 = {.port = GPIOH, .pin = P02};
MM32_GPIO_Pin PH3 = {.port = GPIOH, .pin = P03};

MM32_GPIO_Pin PI0 = {.port = GPIOI, .pin = P00};
MM32_GPIO_Pin PI1 = {.port = GPIOI, .pin = P01};
